Repository: 84000/data-translation-memory
Catalog: toh217-v3.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཅེས་བྱ་བར་གྱུར་ཏོ།
en: Monks, I was the brahmin boy named Dharmakāma at that time.

source: །དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Monks, if you suspect or have doubts that the brahmin who lived at that time was someone else, reconsider.

source: ཁྱིམ་བདག་དཔལ་སྦས་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེར་གྱུར་ཏོ།
en: The householder Śrīgupta was the brahmin at that time.

source: །དགེ་སློང་དག་དེའི་ཚེ་ཡང་ཁྱིམ་བདག་དཔལ་སྦས་ང་མེ་དོང་དུ་བསྲེགས་ལ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་འདོད་པ་ལས། ངས་དེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ནས་བཟློག་ཅིང་།
en: Monks, at that time, I saved the householder Śrīgupta from falling into the great hells because of his wish to burn me in a fire pit and his being destined to fall into the great hells.

source: འཕགས་པའི་ཆོས་འདུལ་བ་ལ་བཞག་སྟེ་འདི་དང་དེ་ཡང་དེ་བཞིན་དུ་ཟུང་ཤིག །དགེ་སློང་དག་ད་ལྟར་ཡང་དཔལ་སྦས་ང་མེ་དོང་དུ་བསྲེགས་ལ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་འདོད་པ་ལས།
en: I established him in the noble Dharma and Vinaya. This is how you should remember these things. Monks, I have also now saved Śrīgupta from falling into the great hells because of his wish to burn me in a fire pit and his being destined to fall into the great hells.

source: ངས་དེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ལས་བཟློག་ཅིང་འཕགས་པའི་ཆོས་འདུལ་བ་ལ་བཞག་སྟེ།
en: I have also established him in the noble Dharma and Vinaya.

source: དེ་དང་འདི་ཡང་དེ་བཞིན་དུ་ཟུང་ཤིག །དགེ་དང་མི་དགེ་སྔོན་བྱས་ཆུད་མི་ཟ།
en: This is how you should remember these things. “Past deeds, virtuous or wicked, are not fruitless;

source: །མཁས་པ་རྣམས་ལ་བསྟེན་པ་ཆུད་མི་ཟ།
en: Relying on the wise is not fruitless;

source: །འཕགས་པའི་ཚོགས་ཀྱིས་ལེགས་བཤད་ཆུད་མི་ཟ།
en: The eloquent expressions of the community of noble ones are not fruitless;

source: །བྱས་ལ་བྱས་གཟོ་ནམ་ཡང་ཆུད་མི་ཟ།
en: Reflecting on past actions is never fruitless.

source: །ལེགས་པར་བྱས་པ་དགེ་བའི་ལས།
en: “What is done with good intent is a virtuous act;

source: །ཉེས་པར་བྱས་པ་མི་དགེ་ཡིན།
en: What is done with evil intent is nonvirtuous.

source: །དེ་ལའང་རྣམ་པར་སྨིན་ཡོད་དེ།
en: Both bear their consequences;

source: །གདོན་མི་ཟ་བར་འབྲས་བུ་སྨིན།
en: Their fruits ripen unfailingly.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དེ་དག་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་བཅས་པ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One was finished speaking, his entire retinue, consisting of monks, nuns, and male and female lay devotees, as well as nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, rejoiced and praised the words of the Blessed One.

source: །འཕགས་པ་དཔལ་སྦས་ཞེས་བྱ་བའི་མདོ་རྫོགས་སོ།།
en: This concludes The Noble Śrīgupta Sūtra

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: Translated by the Indian preceptors Jinamitra and Dānaśīla, and the editor and translator, the monk Yeshé Dé.
